### Pandas Practice Test - Annette Bazan
1. Change FirstName and LastName to your name (for both notebook name and title),
2. Answer each question inside the cell under # Insert answer here",
3. After you answer all questions, Restart Kernel and Run All Cells,
4. Download an HTML version of your completed Notebook,
5. Only questions # 8, 11, 12, 13 do not need codes. All other cells need your codes. 
6. Submit completed test via Canvas Submission window.

In [1]:
# 1. import libraries (both numpy and pandas)
import pandas as pd
import numpy as np

In [2]:
# 2. load the mortality_data and name it df
df = pd.read_csv('mortality_data.csv')

In [3]:
# 3. create a copy of df and name it mortality
mortality = df.copy()

In [4]:
# 4. display the first 8 rows of mortality dataset
mortality.head(8)

   Year  Age Group  Death Rate
0  1900  1-4 Years      1983.8
1  1901  1-4 Years      1695.0
2  1902  1-4 Years      1655.7
3  1903  1-4 Years      1542.1
4  1904  1-4 Years      1591.5
5  1905  1-4 Years      1498.9
6  1906  1-4 Years      1580.0
7  1907  1-4 Years      1468.3

In [5]:
# 5. dispaly the last 5 rows of mortality dataset
mortality.tail(5)

     Year    Age Group  Death Rate
471  2014  15-19 Years        45.5
472  2015  15-19 Years        48.3
473  2016  15-19 Years        51.2
474  2017  15-19 Years        51.5
475  2018  15-19 Years        49.2

In [6]:
# 6. display 5 attributs of mortality dataset
mortality.size

1428

In [7]:
mortality.shape

(476, 3)

In [8]:
mortality.ndim

2

In [9]:
mortality.columns

Index(['Year', 'Age Group', 'Death Rate'], dtype='object')

In [10]:
mortality.dtypes

Year            int64
Age Group      object
Death Rate    float64
dtype: object

In [20]:
# 7. display more information about the mortality dataset
df.describe() # wrong
mortality.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 476 entries, 0 to 475
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        476 non-null    int64
 1   Age Group   476 non-null    object
 2   Death Rate  476 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.3+ KB

In [12]:
# 8. is there any missing values in the mortality dataset? 
# answer here: 
(mortality.isnull().any().any()) # answer is no

False

In [13]:
# 9. What are the dtypes in the mortality dataset? show your code.
mortality.dtypes

Year            int64
Age Group      object
Death Rate    float64
dtype: object

In [14]:
# 10. display the statistical summary of the mortality dataset and transpose the output
summary = df.describe()

# Transpose the summary
transposed_summary = summary.transpose
(transposed_summary)

<bound method DataFrame.transpose of               Year   Death Rate
count   476.000000   476.000000
mean   1959.000000   192.924160
std      34.387268   293.224216
min    1900.000000    11.400000
25%    1929.000000    40.575000
50%    1959.000000    89.500000
75%    1989.000000   222.575000
max    2018.000000  1983.800000>

In [15]:
# 11. what is the range of years (earliest and lastest years) in the mortality dataset?
# answer here: 1900 - 2018

In [16]:
# 12. what are the minimum, and maximum of death rate in the mortality dataset?
# answer here: max=1983.8 min=11.4

In [17]:
# 13. what are the the average and the median of death rate in the mortality dataset?
# answer here: avg =192.924160 median = 89.5

In [18]:
# 14. create a dataframe using a numpy array with 5 rows and 3 columns
# name the columns: 'Age', 'Education', 'Income'
# name the rows (the index): 'No-Experience', 'Entry-Level', 'Experienced', 'Expert', 'Senior'
data = np.array([[25, 12, 40000],
                 [30, 14, 50000],
                 [35, 16, 60000],
                 [40, 18, 70000],
                 [45, 20, 80000]])

columns = ['Age', 'Education', 'Income']
index = ['No-Experience', 'Entry-Level', 'Experienced', 'Expert', 'Senior']

df = pd.DataFrame(data, columns=columns, index=index)

(df)

               Age  Education  Income
No-Experience   25         12   40000
Entry-Level     30         14   50000
Experienced     35         16   60000
Expert          40         18   70000
Senior          45         20   80000

### End of Pandas Test.